public class chapter_02_HomeWork {
    //#02.3 Реляционные базы данных: ДЗ

    //Домашнее задание
    //Самообучающимся студентам.
    //Чтобы закрепить теоретические знания, выполните домашнее задание.

    //Нарисуйте ER-диаграмму библиотеки, включающую следующие объекты:
    //Книга
    //Каталог
    //Читатель
    //Сотрудник
    //Другие по вашему выбору

    //Как мог бы выглядеть интерфейс пользователя этого воображаемого приложения?
    //Опишите интерфейс пользователя или нарисуйте картинку,
    //сопоставляя элементы управления интерфейса с объектами вашей базы данных.

}
