public class chapter_08_HomeWork {
    //#08.3 Linux - пользователи, группы и права доступа к файлам: Практика и ДЗ

    //Самообучающимся студентам и студентам курсов, использующих этот учебник

    //Используя любой эмулятор, выполните следующее:

    //1 - Создайте новую директорию с названием "p.1". Уставите с помощью восьмеричной формы следующие права доступа:
    //все права для владельца, чтение и выполнение для группы и полный запрет для всех остальных

    //2 - Создайте новую директорию с названием "p.2". Установите такие же, как у p1, права с помощью символьной формы.

    //3 - Создайте новую директорию с названием p.3.$USER (где $USER — ваше имя пользователя)
    //в директории /tmp и установите права с помощью значения 550.
    //Создайте в этой директории новый файл. Объясните полученный результат.

    //4 - Для директории /tmp/p.3.$USER добавьте права на запись для владельца.

    //5 - Создайте в этой директории новый файл с любым содержанием, затем установите для файла права с помощью значения 666.

}
