public class chapter_21_HomeWork {
    //#21.3 Локализация дефектов в трёхзвенных приложениях: Практика и ДЗ

    //Самообучающимся студентам и студентам курсов, использующих этот учебник

    //1 - Серверное приложение (разработанное вашей командой) внезапно аварийно завершилось,
    //т.е. завершило работу по неизвестным причинам.
    //Его бизнес-логика и сценарии использования были полностью покрыты тестами и проверены должным образом,
    //поэтому вы уверены, что первопричина кроется в чем-то другом. Сформулируйте подходящие гипотезы.
    //Примечание: приложение может иметь любую архитектуру, в том числе быть обособленным серверным приложением.

    //2 - Составьте список проверок для гипотез из пункта выше.

    //3 - Предложите оптимальный алгоритм и шаги для этой ситуации и объясните, почему они являются оптимальными.

    //4 - Похоже, что бэкенд вашего трёхзвенного веб-приложения неисправен.
    //Вы не можете подключиться к нему по SSH
    //(и потребовалось бы огромное количество времени на получение всех разрешений),
    //поэтому вы не можете просматривать журналы бэкенда, запускать команды на этом севере и т. д.
    //Выработайте гипотезы для полной локализации дефекта.
    //Подсказка: все остальные компоненты находятся под вашим полным контролем.

    //5 - Подготовьте надлежащие и применимые проверки для подтверждения гипотез, изложенных выше.

    //6 - Предложите оптимальный алгоритм и шаги для этой ситуации и объясните, почему они являются оптимальными.

    //7 - Пользователь сообщил, что у него отобразилась ошибка «Неверное имя пользователя или пароль»
    //при работе с фронтендом трёхзвенного приложения.
    //Вы проверили соответствующую БД — и имя пользователя, и пароль действительны.
    //Выработайте применимые гипотезы.

    //8 - Составьте для этих гипотез список подходящих проверок (с инструментами и методиками).

    //9 - Предложите оптимальный алгоритм и шаги для этой ситуации и объясните, почему они являются оптимальными.
}
