public class chapter_09_HomeWork {
    //#09.3 Linux - исполняемые файлы, процессы и службы: Практика и ДЗ

    //Самообучающимся студентам и студентам курсов, использующих этот учебник

    //Укажите точные команды, включая их опции и позиционные аргументы, используемые на каждом шаге.
    //(*) - это продвинутое домашнее задание.

    //Запустите несколько экземпляров команды 'sleep' в фоновом режиме со следующими тайм-аутами:
    //1000, 2000, 4000, 20000 и 200000 секунд.

    //Убедитесь, что они выполняются.

    //Переключитесь на задачу №3, т.е. выведите ее на передний план.

    //Приостановите ее выполнение.

    //Возобновите ее выполнение в фоновом режиме.

    //Убедитесь, что все ваши "спящие" процессы (задачи) запущены.

    //Выведите на экран все "спящие" процессы, аргументы которых начинаются с цифры 2.

    //Завершите все процессы, начиная с предыдущего пункта, используя только одну команду.

    //Убедитесь, что другие "спящие" процессы запущены.

    //Выведите все процессы, выполняемые пользователем вашей ОС(*).

    //Определите точное местоположение их исполняемых файлов.

    //Завершите все оставшиеся "спящие" процессы.

    //(*) Укажите все способы выполнения предыдущего пункта.

    //Выведите все процессы, выполняемые учетной записью "root".

    //Выведите все существующие процессы и объясните, как именно найти процессы демонов
    //(не нужно приводить весь вывод команды в результатах домашнего задания).

    //Выведите все процессы вашего пользователя в древовидном представлении с PID-ами
    //(Примечание: на эмуляторе этот пункт выполнить невозможно).

    //Принудительно завершите выполнение вашей текущей оболочки.
}
