public class chapter_15_HomeWork {
    //#15.3 HTTP, REST, API: Практика и ДЗ

    //Самообучающимся студентам и студентам курсов, использующих этот учебник

    //1 - Ознакомьтесь с API погоды на сайте https://openweathermap.org/current:

    //2 - Зарегистрируйтесь на сайте и получите свой собственный ключ API. Ключ является обязательным для выполнения API вызовов.
    //При необходимости обратитесь к инструкции.

    //3 - Используйте инструмент cURL для отправки запросов.
    //Пользователям ОС Windows может потребоваться сначала установить этот инструмент.
    //В качестве альтернативы студенты курса могут подключиться по ssh к серверу "Sandbox" и отправлять запросы оттуда.

    //4 - Узнайте, как можно получить данные о погоде для вашего любимого места.
    //curl GET https://api.openweathermap.org/data/2.5/weather?lat=53.392&lon=83.936&appid=79a5e39a5c0401506d0f15e0e033a738

    //5 - Отправляйте запросы на получение данных на разных языках: английском, испанском, французском, японском.
    //Подсказка: обратите внимание на описание параметра [lang].

    //6 - Отправьте запрос(ы) на получение значений температуры в градусах Цельсия.
    //Подсказка: обратите внимание на параметр [units].

    //7 - Отправьте запрос, чтобы получить ответные данные в формате XML.

    //8 - Составьте команду cURL, чтобы получить данные о погоде для вашего любимого места на испанском
    //языке и значения температуры в градусах Цельсия.

    //9 - Ваш ответ должен состоять из строк cURL, которые вы составили для пунктов ДЗ #4, #5, #6 и #7.
}
