public class chapter_20 {
    //#20.1 Принципы локализации дефектов: Теория

    //План урока
    //Основы поиска неисправностей в серверных приложениях
    //Алгоритм локализации дефектов
    //Поиск неисправностей на практике


    //Основы поиска неисправностей в серверных приложениях

    //Введение

    //Как было сказано в предыдущем модуле, навыки эффективной локализации дефектов очень полезны для тестировщиков.
    //Итак, что же такое локализация? Нам необходимо ясно определить этот и другие важные термины:




}
