public class chapter_19_HomeWork {
    //#19.3 Архитектура серверного ПО: Практика и ДЗ

    //Самообучающимся студентам

    //1 - Приведите несколько примеров обособленных серверных приложений, не упомянутых в учебнике. Докажите, что они обособленные.

    //2 - Сделайте то же самое для 2-звенных приложений.

    //3 - Сделайте то же самое для 3-звенных приложений.

    //4 - (*) Известно, что сервер MS Exchange поддерживает и тонкие, и толстые клиенты.
    //Какой тип архитектуры имеет это серверное ПО?
    //Поясните свой ответ при помощи ссылок на официальную документацию MS Exchange.
}
