public class chapter_20_HomeWork {
    //#20.3 Принципы локализации дефектов: Практика и ДЗ

    //1 - Ваш младший коллега из технической поддержки передал вам ошибку клиента со следующим комментарием:
    //"Я проверил наше продуктовое окружение.
    //Все в порядке: приложения работают, их журналы не содержат ошибок, серверы подключены друг к другу,
    //никаких безумных правил межсетевых экранов, содержимое БД в порядке".
    //Что мог упустить ваш коллега?

    //2 - Предположим, вы можете открыть веб-сайт со своего смартфона, но не можете сделать это с основного домашнего компьютера:
    //Каковы возможные причины, и как бы вы локализовали это?
    //Предложите оптимальный способ локализации проблемы и объясните свое решение.

    //3 - Представьте, что у вас есть автомобиль с бензиновым двигателем, который не заводится.
    //Опытные мастера говорят: "Воздух, топливо и искра", по сути, разложив всю систему на составляющие.
    //Декомпозируйте эти компоненты еще на 1-2 уровня вниз.
    //Предложите гипотезы о том, что могло пойти не так.
    //Перечислите необходимые проверки для каждой гипотезы.

    //4 - У вас есть похожая проблема с дизельным автомобилем. Какие есть гипотезы и методы их проверки, отличные от п.3?

    //5 - Вы загружаете большой файл (10 Гб) на FTP-сервер. Если раньше эта операция занимала 2 часа,
    //то сегодня она длится уже 4 часа, до сих пор не завершена, а скорость загрузки очень низкая.
    //Декомпозируйте это взаимодействие.

    //6 - Перечислите гипотезы, что могло пойти не так.

    //7 - Предложите проверки для подтверждения гипотез из пункта выше.

    //8 - Предложите оптимальный алгоритм и шаги для его использования и объясните, почему он оптимален.
}
