public class chapter_01_03 {
    //Трёхуровневый метод обучения

    //Каждой теме учебника посвящены следующие разделы: теоретический материал ("Теория")
    //по конкретной теме, один или два набора тестов для самопроверки
    //("Тест", если он один, и "Базовый тест" и "Продвинутый тест", если их два),
    //а также раздел "Практика и ДЗ".


    //1. Теоретический материал

    //В рамках каждой темы понятия объясняются в максимально доступной форме и, естественно,
    //сопровождаются необходимыми наглядными материалами.
    //Все теоретические материалы созданы командой вышеуказанных менторов.
    //Ссылки на внешние ресурсы могут встречаться в двух случаях:
    //- ссылки на стандарты;
    //- дополнительный опциональный материал для собственного изучения.
    //В обоих случаях это будут ссылки на англоязычные материалы.
    //Мы намеренно даем ссылки именно на них, поскольку русскоязычные не всегда соответствуют
    //стандартам качества и актуальности.


    //2. Тесты

    //Изучать тестирование без самопроверки бесполезно.
    //Поэтому в конце каждой темы есть один или два набора тестов с несколькими вопросами.
    //Если студент прошел эти тесты, он может быть уверен,
    //что понял теоретические концепции, готов к практике и выполнению домашних заданий.


    //3. Практика и домашнее задание

    //В практических и домашних заданиях есть разделение по типам студентов -
    //самообучающийся или посещающий курсы, использующие этот учебник.

    //Практика
    //Практика на занятии доступна только студентам курсов, использующих этот учебник.
    //Во время практики под руководством опытного преподавателя студенты выполняют практические
    //задания в облачной песочнице по изученному теоретическому материалу.
    //Это позволяет закрепить полученные знания и получить практические навыки.

    //Домашнее задание
    //Домашнее задание представлено в конце каждого раздела,
    //и для его успешного выполнения вам могут снова понадобиться теоретические материалы.

    //Для самообучающихся студентов
    //Вам потребуется найти ментора, обладающего необходимым опытом в области QA и
    //готового помочь в проверке домашней работы.
    //Найти его непросто, но это самый эффективный вариант для самообучения.


}
