public class chapter_10_HomeWork {
    //#10.3 Linux - окружение, архивы, файловые системы: Практика и ДЗ

    //Самообучающимся студентам и студентам курсов, использующих этот учебник

    //Задания, отмеченные знаком (*) - это продвинутое домашнее задание.

    //Часть 1
    //Укажите различия между:
    //(для студентов, занимающихся самостоятельно) Двумя эмуляторами, упомянутыми в учебнике
    //С точки зрения:
    //CPU (процессора)
    //Памяти: общей, используемой, подкачки
    //Дисковых устройств
    //Свободного пространства в файловых системах

    //Часть 2

    //Переключитесь на учетную запись, не являющуюся рутом, если это возможно.

    //Создайте архив всей директории /etc. Запишите все ошибки в отдельный выходной файл.

    //Подсчитайте количество файлов и директорий без достаточных прав доступа, о которых сообщалось в шаге выше.

    //Повторите шаг 2, используя встроенную функцию сжатия tar.

    //(*) Повторите шаг 2, используя внешнее сжатие с помощью пайпов.

    //Сделайте сжатые копии файлов /etc/passwd и /etc/group.

    //Удалите все файлы, созданные во время выполнения задания.

}
