public class chapter_01 {
    //Добро пожаловать в русскую версию учебника «100-Year QA-textbook»!

    //С чего начнём обучение
    //Что представляет собой учебник «100-Year QA-textbook»?
    //Содержание учебника
    //Трёхуровневый метод обучения


    //Что представляет собой учебник «100-Year QA-textbook»?

    //Этот учебник - бесплатный курс для желающих получить профессию тестировщика программного обеспечения.
    //Он как является пособием для самообучающихся студентов, так и используется на профессиональных
    //QA-курсах в качестве учебного пособия.
    //Учебник интерактивный, потому что в нём есть не только теория
    //в текстовом и графическом виде, но и онлайн-тесты,
    //которые необходимо пройти, чтобы проверить уровень своих знаний.

    //В чём отличие этого учебника от остальных?
    //1 - Создан группой менторов с суммарным опытом в ИТ более 100 лет
    //2 - Полнота и глубина
    //3 - Согласованность
    //4 - Большой объем практики
    //5 - Трёхуровневый метод обучения

    //Все материалы разделены на три уровня:
    //1. Теоретический материал.
    //2. Один или два набора тестов для самопроверки в конце каждой темы.
    //Студент, прошедший тест, может быть уверен в понимании теоретических концепций.
    //3. Практика (для студентов курсов, использующих этот учебник) и интересное
    //домашнее задание в конце каждой темы (для самообучающихся студентов и студентов курсов,
    //использующих этот учебник).

    //6 - Учебник непрерывно обновляется, поскольку постоянно используется

}
