public class chapter_26 {
    //#26.1 Scrum: Теория

    //План урока
    //Применение принципов гибкой разработки и их воплощение в методах (Канбан, Lean)
    //Методология SCRUM
    //Программное обеспечение для управления проектами


    //Применение принципов Agile и различные виды гибкой разработки

    //Мы изучили принципы и идеи гибкой разработки.
    //Теперь посмотрим, как эти принципы применяются в конкретных методах организации процесса разработки.
    //Реализация принципов гибкой разработки даёт множество преимуществ.
    //В процессе команда разработчиков больше сотрудничает с конечными пользователями.
    //Стейкхолдеры (заинтересованные лица) будут знать текущее состояние проекта в любой момент времени и смогут ускорить разработку,
    //назначив приоритеты реализуемым функциям.

    //Основные формы воплощения гибкой разработки.
    //Существует множество путей реализации принципов и идей гибкой разработки. Далее описываются самые используемые.


    //Канбан
    //Этот метод подходит в ситуациях, когда невозможно спрогнозировать,
    //что именно нужно будет сделать, и когда требуется быстрое внедрение без необходимости заботиться о других аспектах работы.
    //Метод используется для построения рабочего процесса, управления им и оптимизации.
    //Канбан позволяет визуализовать ход работ и снизить количество незавершённых задач.
    //В методе Канбан спринты не используются.

    //Доска Канбан делится на три столбца: «нужно сделать», «в работе» и «сделано».
    //На доске виден весь процесс разработки. Доска включает работы, относящиеся к одному конкретному этапу.
    //Команда собирается у доски на ежедневных коротких собраниях (стендапах), проведение которых строго регулируется.
    //Команда начинает обзор с конца доски и анализирует каждое задание.
    //Для каждого задания ставятся вопросы: «Что мешает нам переместить эту задачу на следующую стадию?»,
    //«Не застрял ли на месте исполнитель задания из-за блокирующего препятствия?»,
    //«Что нужно и сколько это займёт времени, чтобы разблокировать задачу?»,
    //«Сколько всего потребуется времени на выполнение этой задачи?».
    //Команда концентрируется на максимально быстром выполнении задачи.


    //Lean

    //Lean — еще одна реализация гибкой методики Agile. Впервые метод был применён в промышленном производстве.
    //Lean настолько хорошо зарекомендовал себя, что его приняло сообщество разработчиков программного обеспечения (ПО).
    //В методе предусмотрено относительно малое количество строгих рекомендаций и правил,
    //поэтому он может поспособствовать повышению продуктивности, эффективности и постоянному усовершенствованию.
    //Lean нацелен на снижение затрат времени и издержек и на повышение качества работы.
    //Предусмотрено пять главных правил реализации метода.

    //1 - Определите ценности с точки зрения пользователей (заказчиков). Что поможет им выполнять свою работу лучше?
    //Во что они готовы вкладывать средства? Как мы можем удовлетворить их потребности?

    //2 - Визуально отобразите каждую ценность, шаг или процесс, вносящие вклад в создание завершённого продукта.
    //Это поможет увидеть, какой шаг или процесс не несёт пользы для конечного продукта.
    //Это позволяет команде обнаруживать и устранять потери времени и сил.

    //3 - Сформируйте непрерывный ход работ благодаря обучению сотрудников, чтобы они могли легко адаптироваться,
    //обладали широким профилем знаний и навыков и были способны выполнять различные обязанности.
    //Это позволит руководителям групп лучше распределять рабочую нагрузку.

    //4 - Создайте систему, позволяющую команде выполнять работу согласно принципу «точно в срок».
    //Разрабатывайте ПО только по необходимости, а не заранее.

    //5 - Для максимальной реализации потенциала метода Lean необходимо постоянное совершенствование.
    //В каждом цикле команда ищет способы для улучшения.


    //Scrum

    //Scrum — один из самых часто используемых методов гибкой разработки.
    //Он лучше других подходит для управления проектами, в которых продукт создаётся небольшими приращениями в ходе итераций.
    //Для управления проектом «владелец продукта» использует ежедневные короткие собрания (стендапы),
    //а для расстановки приоритетов — список незавершённых работ по продукту (бэклог продукта).
    //Разнопрофильная группа работает над частями продукта для реализации потенциально развёртываемого приращения —
    //обычно в течение 2–4-недельного спринта (периода, за который необходимо разработать очередное приращение).
    //В конце каждого спринта список незавершённых работ продукта пересматривается и назначаются новые приоритеты.
    //Метод Scrum популярен, так как ему просто следовать и он легко масштабируем.
    //Руководители с лёгкостью обнаруживают любые проблемы на ранних стадиях.
    //Метод стимулирует активное сотрудничество между членами команды.

}
