public class chapter_12 {
    //#12.1 Сетевые уровни и протокол IP: Теория

    //План урока
    //Введение в стек TCP/IP
    //Протокол IP: адреса, маски подсети, протокол DHCP, маршрутизация
    //Коротко о системе доменных имён DNS (Domain Name System)


    //Введение в стек TCP/IP

    //В предыдущем модуле мы коротко обсудили, как компьютер взаимодействует с сетями.
    //Теперь перейдём к более глубокому изучению этой темы.
    //В прошлый раз мы прошли путь от верхнего уровня (прикладной уровень, веб-браузер)
    //до самого низа (физический уровень, сетевой адаптер).
    //В этой главе мы начнём путь в обратном направлении.

    //До этого мы затронули семейство протоколов TCP/IP — протоколов,
    //которые лежат в основе Интернета и большинства современных компьютерных сетей.
    //Сейчас постараемся упорядочить наши знания.


    //Уровни

    //https://mentorpiece.org/wp-content/uploads/articulate_uploads/the-100-year-qa-textbook-яussian-edition-1-0-2-xapi-QP0TAWc6/assets/YGPYkalbBnxW9mOJ_wXDC1RsqfjILcbkT.png
    //Что представляет собой стек TCP/IP
}
