public class chapter_18_HomeWork {
    //#18.3 Веб-интерфейс пользователя — инструменты и тестирование: Практика и ДЗ

    //Самообучающимся студентам и студентам курсов, использующих этот учебник.
    //Выберите интернет-магазин (например, ebay.com) и изучите его с точки зрения возможных проблем пользовательского интерфейса.

    //Сценарии для изучения:

    //Зарегистрируйте нового клиента

    //Найдите товар

    //Добавьте товар в корзину и удалите его из корзины

    //Измените профиль клиента
}
