public class chapter_34 {
    //#34.1 Методы проектирования тестов — классы эквивалентности и анализ граничных значений: Теория

    //План урока
    //Почему нам нужны методы проектирования тестов, а также немного математики
    //Классы эквивалентности
    //Использование разбиения на классы эквивалентности для покрытия требований при тестировании
    //Анализ граничных значений
    //Анализ граничных значений и их применение для покрытия требований при тестировании
    //Комбинирование классов эквивалентности и граничных значений для тестов. Позитивные и негативные тесты
}
