public class chapter_22_HomeWork {
    //#22.3 Исследовательское тестирование: Практика и ДЗ

    //Самообучающимся студентам

    //Откройте любое небольшое бесплатное приложение или сайт и запланируйте 15-20-минутную сессию исследовательского тестирования.

    //Выберите инструмент для сессии тестирования.

    //Определите цели сессии (например, исследование нового приложения или локализация какого-либо дефекта).

    //Установите ограничение по времени (15-20 минут, в зависимости от вашей обычной скорости).

    //Выполните сессию и занесите результаты в домашнюю работу.
}
