public class chapter_17_HomeWork {
    //#17.3 Веб-интерфейс пользователя: Практика и ДЗ

    //Самообучающимся студентам и студентам курсов, использующих этот учебник

    //Исследуйте функционал сайта по бронированию авиабилетов Delta Airlines с точки зрения возможных проблем WebUI.
    //https://www.delta.com

    //Сценарии для исследования:
    //Обычный поиск рейса в роли гостя.
    //Расширенный поиск рейса в роли гостя.
    //Регистрация (регистрация учетной записи пользователя).
    //Поиск рейса в качестве зарегистрированного пользователя.
}
